#8. Матрица 5x4 заполняется вводом с клавиатуры кроме последних элементов строк.
# Программа должна вычислять сумму введенных элементов каждой строки и записывать ее в последнюю ячейку строки.
# В конце следует вывести полученную матрицу.

print('Введите последовательность из 4-х чисел для каждой строки матрицы через пробел.\nПереход к вводу чисел для следующей строки по кнопке "Enter": ')
matrix = [[int(j) for j in input().split()] for i in range(5)]
print('Матрица, в последней ячейке которой сумма введенных элементов строки:')
for i in range(5):
    for j in range(len(matrix[i])):
        print(matrix[i][j], end=' ')
    print(' | ', sum(matrix[i]))
