# 4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125, ...
# Количество элементов (n) вводится с клавиатуры.

length = int(input('Введите количество элементов последовательности n: '))
sum_ = 0
for i in range(length):
    sum_ += 1 / (-2) ** i
print(f'Сумма последовательности равна {sum_}')