#5. Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно.
# Вывод выполнить в табличной форме: по десять пар «код-символ» в каждой строке.

first_ch = 32
last_ch = 127
for i in range(first_ch, last_ch + 1):
    print(f'{i}\t{chr(i)}')