# 7. Написать программу, доказывающую или проверяющую, что для множества натуральных чисел выполняется равенство:
# 1+2+...+n = n(n+1)/2, где n – любое натуральное число.

n = int(input('Введите размер последовательности n: '))
summa = 0
for i in range(1, n + 1):
    summa += i
if summa == n * (n + 1) / 2:
    print(f'Для n = {n} значение выражения 1+2+...+n = n(n+1)/2 равно {summa}')
else:
    print('Выражение 1+2+...+n = n(n+1)/2 для n = {n} не верно')
