# 5. Пользователь вводит две буквы.
# Определить, на каких местах алфавита они стоят и сколько между ними находится букв.

ch1, ch2 = input('Введите две буквы латинского алфавита: ').split()

pos_ch1 = ord(ch1) - 64
pos_ch2 = ord(ch2) - 64
dist = abs(pos_ch1 - pos_ch2) - 1

print(f'Буква "{ch1}" занимает позицию в алфавите {pos_ch1}.\n'
      f'Буква "{ch2}" занимает позицию в алфавите {pos_ch2}.\n'
      f'Дистанция между буквами {dist}.')